prielhoffman/STM32_Smart_Plant_Monitor/Firmware/Src/main.c
static void ADC_GPIO_Init(void){
	GPIO_Handle_t adc_gpio;

	adc_gpio.pGPIOx = GPIOA;

	adc_gpio.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ANALOG;
	adc_gpio.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
	adc_gpio.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	adc_gpio.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	adc_gpio.GPIO_PinConfig.GPIO_PinAltFunMode = 0;

    /* PA0 -> ADC channel 0, LDR light sensor */
	adc_gpio.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GPIO_Init(&adc_gpio);

    /* PA1 -> ADC channel 1, soil moisture sensor */
	adc_gpio.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_1;
	GPIO_Init(&adc_gpio);
}

static void UserButton_GPIO_Init(void){
    GPIO_Handle_t button_gpio;

    button_gpio.pGPIOx = GPIOC;
    button_gpio.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
    button_gpio.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
    button_gpio.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
    button_gpio.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    button_gpio.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    button_gpio.GPIO_PinConfig.GPIO_PinAltFunMode = 0;

    GPIO_Init(&button_gpio);
}

static uint8_t UserButton_WasPressed(void){
	static uint8_t last_button_state = GPIO_PIN_SET;

	uint8_t current_button_state = GPIO_ReadFromInputPin(GPIOC, GPIO_PIN_NO_13);
	uint8_t was_pressed = 0U;

    /*
     * The onboard user button is active-low:
     * Released = SET
     * Pressed = RESET
     * Detect only the transition from released to pressed.
     */
	if ((last_button_state == GPIO_PIN_SET) && (current_button_state == GPIO_PIN_RESET)){
		was_pressed = 1U;
	}
	last_button_state = current_button_state;
	return was_pressed;
}

static void I2C1_GPIO_Init(void){
	GPIO_Handle_t I2CPins;
	memset(&I2CPins, 0, sizeof(I2CPins));

	I2CPins.pGPIOx = GPIOB;

	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PU;
	I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 6U;

	/* PB8 -> I2C1_SCL */
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_8;
	GPIO_Init(&I2CPins);

	 /* PB9 -> I2C1_SDA */
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_9;
	GPIO_Init(&I2CPins);
}

static void I2C1_LCD_Init(void){
    memset(&g_i2c1_handle, 0, sizeof(g_i2c1_handle));

    g_i2c1_handle.pI2Cx = I2C1;

    g_i2c1_handle.I2CConfig.I2C_SCLSpeed = I2C_SCL_SPEED_SM;
    g_i2c1_handle.I2CConfig.I2C_DeviceAddress = 0x61U;
    g_i2c1_handle.I2CConfig.I2C_ACKControl = I2C_ACK_ENABLE;
    g_i2c1_handle.I2CConfig.I2C_FMDutyCycle = I2C_FM_DUTY_2;

    I2C_Init(&g_i2c1_handle);
}

/* Print the current system state over UART */
static void Log_CurrentState(SystemState_t state){
	UART_Log("[STATE] ");
	UART_Log(SystemState_ToString(state));
	UART_Log("\r\n");
}

static void AlertLEDs_GPIO_Init(void)
{
    GPIO_Handle_t led_gpio;

    led_gpio.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    led_gpio.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    led_gpio.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
    led_gpio.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

    /* Red LED - PA10 */
    led_gpio.pGPIOx = RED_LED_GPIO_PORT;
    led_gpio.GPIO_PinConfig.GPIO_PinNumber = RED_LED_GPIO_PIN;
    GPIO_Init(&led_gpio);

    /* Yellow LED - PB3 */
    led_gpio.pGPIOx = YELLOW_LED_GPIO_PORT;
    led_gpio.GPIO_PinConfig.GPIO_PinNumber = YELLOW_LED_GPIO_PIN;
    GPIO_Init(&led_gpio);

    /* Green LED - PB5 */
    led_gpio.pGPIOx = GREEN_LED_GPIO_PORT;
    led_gpio.GPIO_PinConfig.GPIO_PinNumber = GREEN_LED_GPIO_PIN;
    GPIO_Init(&led_gpio);

    GPIO_WriteToOutputPin(RED_LED_GPIO_PORT, RED_LED_GPIO_PIN, GPIO_PIN_RESET);
    GPIO_WriteToOutputPin(YELLOW_LED_GPIO_PORT, YELLOW_LED_GPIO_PIN, GPIO_PIN_RESET);
    GPIO_WriteToOutputPin(GREEN_LED_GPIO_PORT, GREEN_LED_GPIO_PIN, GPIO_PIN_RESET);
}

static void AlertLEDs_Update(PlantStatus_t status){
    GPIO_WriteToOutputPin(RED_LED_GPIO_PORT, RED_LED_GPIO_PIN, GPIO_PIN_RESET);
    GPIO_WriteToOutputPin(YELLOW_LED_GPIO_PORT, YELLOW_LED_GPIO_PIN, GPIO_PIN_RESET);
    GPIO_WriteToOutputPin(GREEN_LED_GPIO_PORT, GREEN_LED_GPIO_PIN, GPIO_PIN_RESET);

    switch(status){
    	case PLANT_STATUS_OK:
    		GPIO_WriteToOutputPin(GREEN_LED_GPIO_PORT, GREEN_LED_GPIO_PIN, GPIO_PIN_SET);
    		break;

    	case PLANT_STATUS_LOW_SOIL:
    	case PLANT_STATUS_LOW_LIGHT:
    		GPIO_WriteToOutputPin(YELLOW_LED_GPIO_PORT, YELLOW_LED_GPIO_PIN, GPIO_PIN_SET);
    		break;

    	case PLANT_STATUS_LOW_SOIL_AND_LIGHT:
    	case PLANT_STATUS_SENSOR_ERROR:
    		GPIO_WriteToOutputPin(RED_LED_GPIO_PORT, RED_LED_GPIO_PIN, GPIO_PIN_SET);
    		break;

        default:
            GPIO_WriteToOutputPin(RED_LED_GPIO_PORT, RED_LED_GPIO_PIN, GPIO_PIN_SET);
            break;
    }
}

static void LCD_UpdateDisplay(void){
    char line1[17];
    char line2[17];

    if (g_lcd_page == 0U){
        snprintf(line1, sizeof(line1), "Moisture:%3u%%   ", g_plant_data.soil_percent);
        snprintf(line2, sizeof(line2), "Light:%3u%%      ", g_plant_data.light_percent);
    }
    else if (g_lcd_page == 1U){
        if (g_plant_data.bme280_is_available){
            snprintf(line1, sizeof(line1), "Temp:%2ld.%02ldC   ", g_plant_data.air_temperature_c_x100 / 100, g_plant_data.air_temperature_c_x100 % 100);
            snprintf(line2, sizeof(line2), "Hum:%2lu.%02lu%%    ", g_plant_data.air_humidity_percent_x100 / 100U, g_plant_data.air_humidity_percent_x100 % 100U);
        }
        else{
            snprintf(line1, sizeof(line1), "%-16s", "Env sensor:");
            snprintf(line2, sizeof(line2), "%-16s", "Not available");
        }
    }
    else{
        snprintf(line1, sizeof(line1), "%-16s", "Plant says:");
        snprintf(line2, sizeof(line2), "%-16s", PlantStatus_ToLCDString(g_plant_data.plant_status));
    }

    LCD_SetCursor(0, 0);
    LCD_Print(line1);

    LCD_SetCursor(1, 0);
    LCD_Print(line2);
}

static void LCD_HandlePageButton(void){
    if (UserButton_WasPressed()){
        g_lcd_page++;

        if (g_lcd_page >= LCD_PAGE_COUNT){
            g_lcd_page = 0U;
        }

