prielhoffman/STM32_Smart_Plant_Monitor/Firmware/Src/main.c
        /*
         * Update the LCD immediately after changing the page,
         * so the user sees the result of the button press right away.
         */
        LCD_UpdateDisplay();

        UART_Log("[BUTTON] LCD page changed\r\n");
    }
}

static void BME280_Application_Init(void){
    uint8_t chip_id = 0U;
    BME280_CalibData_t calib_data;

    BME280_Init(&g_i2c1_handle, BME280_I2C_ADDR);

    UART_Log("[BME280] Initializing environmental sensor\r\n");

    if (!BME280_ReadChipID(&chip_id)){
        UART_Log("[BME280] Chip ID read failed\r\n");
        g_plant_data.bme280_is_available = 0U;
        return;
    }

    if (chip_id != BME280_CHIP_ID_VALUE){
        UART_Log("[BME280] Unexpected chip ID\r\n");
        g_plant_data.bme280_is_available = 0U;
        return;
    }

    UART_Log("[BME280] Sensor detected successfully\r\n");

    if (!BME280_ReadCalibrationData(&calib_data)){
        UART_Log("[BME280] Calibration data read failed\r\n");
        g_plant_data.bme280_is_available = 0U;
        return;
    }

    if (!BME280_ConfigureMeasurement()){
        UART_Log("[BME280] Measurement configuration failed\r\n");
        g_plant_data.bme280_is_available = 0U;
        return;
    }

    g_plant_data.bme280_is_available = 1U;
    UART_Log("[BME280] Environmental sensor ready\r\n");
}

static void BME280_ReadEnvironment(void){
    BME280_CompensatedData_t env_data;

    if (g_plant_data.bme280_is_available == 0U){
        return;
    }

    if (BME280_ReadTemperatureHumidity(&env_data)){
        g_plant_data.air_temperature_c_x100 = env_data.temperature_c_x100;
        g_plant_data.air_humidity_percent_x100 = env_data.humidity_percent_x100;
    }
    else{
        UART_Log("[BME280] Environment read failed\r\n");
        g_plant_data.bme280_is_available = 0U;
    }
}

static void DS3231_Application_Init(void){
    DS3231_DateTime_t date_time;

    DS3231_Init(&g_i2c1_handle, DS3231_I2C_ADDR);

    UART_Log("[DS3231] Initializing RTC\r\n");

    if (DS3231_GetDateTime(&date_time)){
        g_plant_data.timestamp = date_time;
        g_plant_data.rtc_is_available = 1U;
        UART_Log("[DS3231] RTC ready\r\n");
    }
    else{
        g_plant_data.rtc_is_available = 0U;
        UART_Log("[DS3231] RTC read failed\r\n");
    }
}

static void DS3231_ReadTimestamp(void){
    DS3231_DateTime_t date_time;

    if (g_plant_data.rtc_is_available == 0U){
        return;
    }

    if (DS3231_GetDateTime(&date_time)){
        g_plant_data.timestamp = date_time;
    }
    else{
        g_plant_data.rtc_is_available = 0U;
        UART_Log("[DS3231] Timestamp read failed\r\n");
    }
}

static void SPI1_GPIO_Init(void){
    GPIO_Handle_t spi_gpio;

    memset(&spi_gpio, 0, sizeof(spi_gpio));

    spi_gpio.pGPIOx = GPIOA;
    spi_gpio.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
    spi_gpio.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
    spi_gpio.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    spi_gpio.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;

    /*
     * STM32G071:
     * PA5 = SPI1_SCK
     * PA6 = SPI1_MISO
     * PA7 = SPI1_MOSI
     * On STM32G071 these SPI1 pins use AF0
     */
    spi_gpio.GPIO_PinConfig.GPIO_PinAltFunMode = 0U;

    /* PA5 -> SPI1_SCK */
    spi_gpio.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_5;
    GPIO_Init(&spi_gpio);

    /* PA6 -> SPI1_MISO */
    spi_gpio.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
    GPIO_Init(&spi_gpio);

    /* PA7 -> SPI1_MOSI */
    spi_gpio.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
    GPIO_Init(&spi_gpio);
}

static void SD_CS_GPIO_Init(void){
    GPIO_Handle_t cs_gpio;

    memset(&cs_gpio, 0, sizeof(cs_gpio));

    cs_gpio.pGPIOx = SD_CS_GPIO_PORT;
    cs_gpio.GPIO_PinConfig.GPIO_PinNumber = SD_CS_GPIO_PIN;
    cs_gpio.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    cs_gpio.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
    cs_gpio.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    cs_gpio.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    cs_gpio.GPIO_PinConfig.GPIO_PinAltFunMode = 0U;

    GPIO_Init(&cs_gpio);

    /*
     * CS is active-low
     * Keep the card deselected when we are not talking to it
     */
    GPIO_WriteToOutputPin(SD_CS_GPIO_PORT, SD_CS_GPIO_PIN, GPIO_PIN_SET);
}

static void SPI1_SD_Init(void){
    memset(&g_spi1_handle, 0, sizeof(g_spi1_handle));

    g_spi1_handle.pSPIx = SPI1;

    /*
     * SD card initialization should start with a slow SPI clock
     * DIV256 is slow and safe for bring-up
     */
    g_spi1_handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
    g_spi1_handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
    g_spi1_handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV256;
    g_spi1_handle.SPIConfig.SPI_DataSize = SPI_DS_8BITS;
    g_spi1_handle.SPIConfig.SPI_CPOL = SPI_CPOL_LOW;
    g_spi1_handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
    g_spi1_handle.SPIConfig.SPI_SSM = SPI_SSM_EN;

    SPI_Init(&g_spi1_handle);
    SPI_PeripheralControl(SPI1, ENABLE);
}

static void SD_CardFullInit_Test(void)
{
    uint8_t init_ok = 0U;

    UART_Log("[SD] Initializing SPI interface\r\n");

    SPI1_GPIO_Init();
    SD_CS_GPIO_Init();
    SPI1_SD_Init();

    SD_Card_Init(&g_spi1_handle, SD_CS_GPIO_PORT, SD_CS_GPIO_PIN);

    UART_Log("[SD] Initializing card\r\n");

    init_ok = SD_Card_InitCard();

    if (init_ok)
    {
        UART_Log("[SD] Card initialized successfully\r\n");

        if (SD_Card_GetType() == SD_CARD_TYPE_SDHC)
        {
            UART_Log("[SD] Card type: SDHC\r\n");
        }
        else
        {
            UART_Log("[SD] Card type: unknown\r\n");
        }
    }
    else
    {
        UART_Log("[SD] Card initialization failed\r\n");
    }
}

int main(void)
{
	USART2_GPIO_Init();
    USART2_Debug_Init();

    AlertLEDs_GPIO_Init();
    UserButton_GPIO_Init();

    I2C1_GPIO_Init();
    I2C1_LCD_Init();

    LCD_Init(&g_i2c1_handle, LCD_I2C_ADDR);

    BME280_Application_Init();
    DS3231_Application_Init();
    SD_CardFullInit_Test();

    ADC_GPIO_Init();
    ADC_Init();

    UART_Log("[ADC] ADC initialized and ready\r\n");

    g_current_state = SYSTEM_STATE_INIT;
    Log_CurrentState(g_current_state);

    g_current_state = SYSTEM_STATE_READ_SENSORS;

    while (1)
    {
    	Log_CurrentState(g_current_state);

        switch (g_current_state)
        {
            case SYSTEM_STATE_READ_SENSORS:
            	DS3231_ReadTimestamp();
            	g_plant_data.soil_raw = ADC_ReadChannel(ADC_CHANNEL_1);
            	g_plant_data.light_raw = ADC_ReadChannel(ADC_CHANNEL_0);
            	BME280_ReadEnvironment();

            	UART_Log("[SENSORS] Timestamp, soil, light and environment updated\r\n");

                g_current_state = SYSTEM_STATE_PROCESS_DATA;
                break;

