prielhoffman/STM32_Smart_Plant_Monitor/Firmware/Src/main.c
            case SYSTEM_STATE_PROCESS_DATA:
            {
                g_plant_data.light_percent = ConvertRawToPercent(g_plant_data.light_raw, LIGHT_DARK_RAW, LIGHT_BRIGHT_RAW);
                g_plant_data.soil_percent = 100U - ConvertRawToPercent(g_plant_data.soil_raw, SOIL_WET_RAW, SOIL_DRY_RAW);

                g_plant_data.plant_status = PlantMonitor_CalculateStatus(&g_plant_data);
                UART_Log("[PROCESS] Plant status updated\r\n");

                g_current_state = SYSTEM_STATE_UPDATE_ALERTS;
                break;
            }

            case SYSTEM_STATE_UPDATE_ALERTS:
            	AlertLEDs_Update(g_plant_data.plant_status);

                UART_Log("[ALERT] Plant status = ");
                UART_Log(PlantStatus_ToString(g_plant_data.plant_status));
                UART_Log("\r\n");

                g_current_state = SYSTEM_STATE_UPDATE_DISPLAY;
                break;

            case SYSTEM_STATE_UPDATE_DISPLAY:
            	LCD_UpdateDisplay();

                UART_Log("[DISPLAY] LCD updated\r\n");

                g_current_state = SYSTEM_STATE_PRINT_LOG;
                break;

            case SYSTEM_STATE_PRINT_LOG:
            {
                char log_buffer[220];

                if (g_plant_data.rtc_is_available && g_plant_data.bme280_is_available){
                    snprintf(log_buffer,
                             sizeof(log_buffer),
                             "[LOG] 20%02u-%02u-%02u %02u:%02u:%02u | soil_raw=%u, soil=%u%%, light_raw=%u, light=%u%%, temp=%ld.%02ldC, hum=%lu.%02lu%%, status=%s\r\n",
                             g_plant_data.timestamp.year,
                             g_plant_data.timestamp.month,
                             g_plant_data.timestamp.date,
                             g_plant_data.timestamp.hours,
                             g_plant_data.timestamp.minutes,
                             g_plant_data.timestamp.seconds,
                             g_plant_data.soil_raw,
                             g_plant_data.soil_percent,
                             g_plant_data.light_raw,
                             g_plant_data.light_percent,
                             g_plant_data.air_temperature_c_x100 / 100,
                             g_plant_data.air_temperature_c_x100 % 100,
                             g_plant_data.air_humidity_percent_x100 / 100U,
                             g_plant_data.air_humidity_percent_x100 % 100U,
                             PlantStatus_ToString(g_plant_data.plant_status));
                }
                else if (g_plant_data.rtc_is_available){
                    snprintf(log_buffer,
                             sizeof(log_buffer),
                             "[LOG] 20%02u-%02u-%02u %02u:%02u:%02u | soil_raw=%u, soil=%u%%, light_raw=%u, light=%u%%, env=N/A, status=%s\r\n",
                             g_plant_data.timestamp.year,
                             g_plant_data.timestamp.month,
                             g_plant_data.timestamp.date,
                             g_plant_data.timestamp.hours,
                             g_plant_data.timestamp.minutes,
                             g_plant_data.timestamp.seconds,
                             g_plant_data.soil_raw,
                             g_plant_data.soil_percent,
                             g_plant_data.light_raw,
                             g_plant_data.light_percent,
                             PlantStatus_ToString(g_plant_data.plant_status));
                }
                else if (g_plant_data.bme280_is_available){
                    snprintf(log_buffer,
                             sizeof(log_buffer),
                             "[LOG] soil_raw=%u, soil=%u%%, light_raw=%u, light=%u%%, temp=%ld.%02ldC, hum=%lu.%02lu%%, status=%s\r\n",
                             g_plant_data.soil_raw,
                             g_plant_data.soil_percent,
                             g_plant_data.light_raw,
                             g_plant_data.light_percent,
                             g_plant_data.air_temperature_c_x100 / 100,
                             g_plant_data.air_temperature_c_x100 % 100,
                             g_plant_data.air_humidity_percent_x100 / 100U,
                             g_plant_data.air_humidity_percent_x100 % 100U,
                             PlantStatus_ToString(g_plant_data.plant_status));
                }
                else{
                    snprintf(log_buffer,
                             sizeof(log_buffer),
                             "[LOG] soil_raw=%u, soil=%u%%, light_raw=%u, light=%u%%, env=N/A, status=%s\r\n",
                             g_plant_data.soil_raw,
                             g_plant_data.soil_percent,
                             g_plant_data.light_raw,
                             g_plant_data.light_percent,
                             PlantStatus_ToString(g_plant_data.plant_status));
                }

                UART_Log(log_buffer);

                g_current_state = SYSTEM_STATE_WAIT;
                break;
            }
            case SYSTEM_STATE_WAIT:
            {
                UART_Log("[WAIT] Waiting before next measurement cycle\r\n");

                for (uint8_t i = 0; i < 10U; i++){
                    LCD_HandlePageButton();
                    short_delay();
                }

                g_current_state = SYSTEM_STATE_READ_SENSORS;
                break;
            }

            default:
                g_current_state = SYSTEM_STATE_READ_SENSORS;
                break;
        }
    }
}
